---
kind: property
id: P:Autodesk.Revit.DB.Lighting.LightType.DimmingColor
source: html/8b0cde8f-3228-045d-17cf-ae2b5dbe0b91.htm
---
# Autodesk.Revit.DB.Lighting.LightType.DimmingColor Property

The dimming temperature value in Kelvins.

## Syntax (C#)
```csharp
public LightDimmingColor DimmingColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration